Revit 2027 API
BuiltInFailures.SketchFailures.TrussOverlappingReference Property
 Truss references (chains of one or more reference lines) cannot overlap themselves in the vertical direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussOverlappingReference { get; }
Public Shared ReadOnly Property TrussOverlappingReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussOverlappingReference {
	FailureDefinitionId^ get ();
}
static member TrussOverlappingReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace